In [57]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
from sklearn import linear_model

In [30]:
obj=pd.Series([1, "John", 3.4, "Hey"])
obj

0       1
1    John
2     3.4
3     Hey
dtype: object

In [31]:
obj.values

array([1, 'John', 3.4, 'Hey'], dtype=object)

In [32]:
obj[0]

1

In [33]:
obj[0:3]

0       1
1    John
2     3.4
dtype: object

In [34]:
obj2=pd.Series([1, "John", 3.4, "Hey"], index=["a","b","c","d"])
obj2

a       1
b    John
c     3.4
d     Hey
dtype: object

In [35]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [36]:
obj2["b"]

'John'

In [37]:
obj2[["a","c"]]

a      1
c    3.4
dtype: object

In [38]:
score={"Jane":90, "Bill":80,"Elon":85,"Tom":75,"Tim":95}
names=pd.Series(score)
names

Jane    90
Bill    80
Elon    85
Tom     75
Tim     95
dtype: int64

In [39]:
results=names>=85
results

Jane     True
Bill    False
Elon     True
Tom     False
Tim      True
dtype: bool

In [40]:
names[results]

Jane    90
Elon    85
Tim     95
dtype: int64

In [41]:
names.index

Index(['Jane', 'Bill', 'Elon', 'Tom', 'Tim'], dtype='object')

In [42]:
names["Tom"]=60
names

Jane    90
Bill    80
Elon    85
Tom     60
Tim     95
dtype: int64

In [43]:
names[names<=85]=83
names

Jane    90
Bill    83
Elon    83
Tom     83
Tim     95
dtype: int64

# Function & Operations

In [44]:
"Tom" in names

True

In [45]:
obj2.isin(["John", "Tom"])

a    False
b     True
c    False
d    False
dtype: bool

In [46]:
names/10

Jane    9.0
Bill    8.3
Elon    8.3
Tom     8.3
Tim     9.5
dtype: float64

In [47]:
names.sort_values()

Bill    83
Elon    83
Tom     83
Jane    90
Tim     95
dtype: int64

In [48]:
names.sort_values(ascending=False)

Tim     95
Jane    90
Bill    83
Elon    83
Tom     83
dtype: int64

# Data Frames

In [49]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [50]:
weather_data = {
'Day': ['1/1/2022','1/2/2022','2/3/2022','2/4/2022','3/5/2022'],
'Temperature':[31, 32, 30, 33, 28],
'Humidity':[65, 60, 55, 72, 84],
'Wind Speed':[22, 15, 12, 11, 13],
'Event':['Windy', 'Sunny', 'Windy', 'Sunny', 'Rainy']
}

weather = pd.DataFrame(weather_data)

weather

        Day  Temperature  Humidity  Wind Speed  Event
0  1/1/2022           31        65          22  Windy
1  1/2/2022           32        60          15  Sunny
2  2/3/2022           30        55          12  Windy
3  2/4/2022           33        72          11  Sunny
4  3/5/2022           28        84          13  Rainy

In [52]:
weather_data = [ 
('1/1/2022', 31, 65, 22, 'Windy'),
('1/2/2022', 32, 60, 15, 'Sunny'),
('2/3/2022', 30, 55, 12, 'Windy'),
('2/4/2022', 33, 72, 11, 'Sunny'),
('3/5/2022', 28, 84, 13, 'Rainy')
]

weather = pd.DataFrame(weather_data, columns=["Day","Temperature","Humidity","Wind Speed","Event"] )

weather

        Day  Temperature  Humidity  Wind Speed  Event
0  1/1/2022           31        65          22  Windy
1  1/2/2022           32        60          15  Sunny
2  2/3/2022           30        55          12  Windy
3  2/4/2022           33        72          11  Sunny
4  3/5/2022           28        84          13  Rainy

In [53]:
df=pd.DataFrame(data,columns=["oranges", "apples"])
df

   oranges  apples
0        0       3
1        3       2
2        7       0
3        2       1

In [ ]:
-----------------------------

In [55]:
df=pd.read_csv('iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [ ]:
df=pd.read_csv('iris.csv')
df

In [59]:
df=pd.read_table('data_comma_headers.txt')
df

  Day,Temperature,Humidity,Wind Speed,Event
0                 2022-01-01,31,65,22,Windy
1                 2022-01-02,32,60,15,Sunny
2                 2022-01-03,30,55,12,Windy
3                 2022-01-04,33,72,11,Sunny
4                 2022-01-05,28,84,13,Rainy

In [60]:
df2=pd.read_table("data_tab_headers.txt", sep="\t")
df2

          Day  Temperature  Humidity  Wind Speed  Event
0  2022-01-01           31        65          22  Windy
1  2022-01-02           32        60          15  Sunny
2  2022-01-03           30        55          12  Windy
3  2022-01-04           33        72          11  Sunny
4  2022-01-05           28        84          13  Rainy

In [61]:
df2=pd.read_table("data_space_headers.txt", sep=" ")
df2

          Day  Temperature  Humidity  Wind  Speed  Event
0  2022-01-01           31        65    22  Windy    NaN
1  2022-01-02           32        60    15  Sunny    NaN
2  2022-01-03           30        55    12  Windy    NaN
3  2022-01-04           33        72    11  Sunny    NaN
4  2022-01-05           28        84    13  Rainy    NaN

In [62]:
df=pd.read_table("data_comma.txt", sep=", ", header=None)
df

/var/folders/q3/wsvj_9ld6fx8f7ld_bhhz3r40000gp/T/ipykernel_94370/2376942579.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df=pd.read_table("data_comma.txt", sep=", ", header=None)

                           0
0  2022-01-01,31,65,22,Windy
1  2022-01-02,32,60,15,Sunny
2  2022-01-03,30,55,12,Windy
3  2022-01-04,33,72,11,Sunny
4  2022-01-05,28,84,13,Rainy

In [64]:
df.columns = ["Day", "Temp", "H", "S","Sf", "D"]
df

ValueError: Length mismatch: Expected axis has 1 elements, new values have 6 elements

In [66]:
df=pd.read_table("data_comma.txt", sep="," , header=None,
                names=["Day", "Temperature", "Humidity", "Wind Speed", "Event"],
                index_col="Day")

df

            Temperature  Humidity  Wind Speed  Event
Day
2022-01-01           31        65          22  Windy
2022-01-02           32        60          15  Sunny
2022-01-03           30        55          12  Windy
2022-01-04           33        72          11  Sunny
2022-01-05           28        84          13  Rainy

In [69]:
df3=pd.read_table("data_comma.txt", sep="," ,
                 skiprows=[0,2],
                 usecols=[0,1],
                 nrows=2)

df3

   2022-01-02  32
0  2022-01-04  33
1  2022-01-05  28

In [71]:
df=pd.read_excel("tips.xlsx", "tips")
df

     Total_bill   Tip     Sex Smoker   Day    Time  Size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [74]:
df=pd.read_csv('data_tab.txt', sep="\t")
df

   2022-01-01  31  65  22  Windy
0  2022-01-02  32  60  15  Sunny
1  2022-01-03  30  55  12  Windy
2  2022-01-04  33  72  11  Sunny
3  2022-01-05  28  84  13  Rainy

In [75]:
df.to_csv('new_data.csv')